# KgfDashMPerM Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KgfDashMPerM Property
SymbolTypeId Class See Also
---
Symbol kgf-m/m, indicating unit Kilogram force meters per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KgfDashMPerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KgfDashMPerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KgfDashMPerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace